'use client';
import React from 'react';
import { PageWrapper } from '../PageWrapper';
import ArchWithStar from '../components/ArcWithStar';

import Image from 'next/image';
import EventsPageEventCard from '../EventCard';

const games = [
  {
    image: '/lava.jpg',
    title: 'Лава ',
    description: `Вълнуващо приключение в зони за игра на закрито, което съчетава забавление с физическа активност. Децата могат да се насладят на предизвикателството да пресекат „лавата“ подова настилка без докосване, насърчавайки тяхното решаване на проблеми, стратегическо мислене и социални умения. С интерактивното си естество, играта стимулира когнитивното развитие и насърчава честната игра и добрите маниери сред децата, като същевременно осигурява незабравимо изживяване в зоните за игра.`,
  },
  {
    image: '/football.jpg',
    title: 'Игрален прожектор',
    description: `Предлагат иновативна форма на забавление в зоните за игра на закрито, предоставяйки по-ангажиращо и визуално изживяване в сравнение с традиционните игри. Тези технологии създават уникална игрова атмосфера чрез различни теми на играта, които се харесват на деца, тийнейджъри и възрастни. Игрите включват образователни елементи, съчетавайки учене и забавление за подкрепа на когнитивното развитие. Груповите дейности, включени в тези игри, насърчават работата в екип и подобряват социалните умения. Контролираната среда на проекционните игри в зоните за игра гарантира безопасно и приятно изживяване. Освен че насърчават физическата активност, тези игри стимулират умствената дейност. Като цяло проекционните игри подобряват зоните за игра на закрито чрез осигуряване на безопасна, контролирана и забавна среда, която отговаря на разнообразните интереси и възрастови групи.`,
  },
  {
    image: '/ballshot.jpg',
    title: 'Стрелбище',
    description: `Балонът за стрелба е иновативно решение, което съчетава технология за проекция и геймърски компютър, за да създаде уникално и завладяващо изживяване. Съсредоточени около целта игри: Действието в тези игри се върти около уцелването на проектирани цели. Специални сензори откриват вашите изстрели и ги отразяват в играта. 20 различни игри: Балонът за стрелба разнообразява вашето удоволствие от играта с избор от 20 различни игри. Режим мултиплейър и режим един играч: Можете да се състезавате с приятели или да се насладите на самостоятелно забавление. Лесни за използване въздушни пушки: Бутонните въздушни пушки позволяват лесно насочване благодарение на тяхната свободна мобилност. Мощен процесор: Подкрепен от мощен процесор, Ball Shoot гарантира гладко и приятно гейминг изживяване. Персонализиране: Настройте игралната зона според вашата тема или цветовете на марката.`,
  },
  {
    image: '/airlabyrinth.jpg',
    title: 'Въздушния лабиринг',
    description: `Комбинирайте игралната конзола с живия батут, за да подобрите детското забавление и любопитство. Малките топки навигират през прозрачните тръби, образувайки лабиринт, преди да се върнат в зоната за игра, като същевременно развиват двигателните умения. Конзолата отговаря на международните стандарти за безопасност, осигурявайки спокойна среда за игра на родители и деца.`,
  },
  {
    image: '/climbing.jpg',
    title: 'Стена за катерене',
    description: `Стената за катерене е вълнуваща и предизвикателна атракция, предлагаща забавно и физически натоварващо изживяване за катерачи от всички нива на умения. Проектирана с множество маршрути за катерене с различна степен на трудност, тя позволява на участниците да подобрят своите катерачни умения и увереност в сигурна среда. Стената включва удобни захвати, надвеси и боулдъри, които помагат на катерачите да развият своята сила, гъвкавост, баланс и координация, като същевременно насърчават чувството за постижение и работа в екип. Независимо дали сте начинаещ, опитен катерач или семейство, което търси забавно занимание, стената за катерене предлага вълнуващо и полезно изживяване за всички.`,
  },
  {
    image: '/magicball.jpg',
    title: 'Вълшебното кълбо',
    description: `Вълшебното кълбо, задължително допълнение към зоните за малки деца, предлага радостта от пускането на цветни, жизнени топки във въздуха. Потребителите могат магически да контролират движенията на топките в небето с ръцете си, позволявайки им да се наслаждават на очарователните моменти на това магическо преживяване. Безкрайният огледален ефект подобрява чудесата на вашите творения, превръщайки всеки момент в необикновена експедиция. Украсен с пленяващ дизайн и хипнотизиращи LED светлини, това приключение става още по-омагьосващо. Потопете малките деца в свят на чудеса с Вълшебното кълбо, където радостта от пускането на цветни, жизнени топки във въздуха се среща с магията да можеш да ги контролираш с ръцете си. В капана на този причудлив опит всяко движение се отразява безкрайно, създавайки атмосфера на постоянно чудо и вдъхновявайки въображението на младите умове.`,
  },
  {
    image: '/soccerarena.jpg',
    title: 'Футболна арена',
    description: `Футболният мач предлага вълнуващо изживяване за футболни ентусиасти, независимо от сезона. Провежда се на специално проектирано футболно игрище и включва сензорни конзоли с четири различни дупки за добавяне на елемент на конкуренция. Тази игра позволява на футболните ентусиасти да практикуват спорта през цялата година, насърчавайки социалната интеграция и физическата активност в забавна и енергична среда.`,
  },
  {
    image: '/NGOlights.jpg',
    title: 'Владетелят на танци',
    description: `Предизвикайте приятелите или семейството си в приключение, изпълнено със скорост, прецизност и координация. Играта Lord of Lights, предназначена за 2 играчи, ви кани да се състезавате за контрол над мигащите LED светлини, появяващи се на конзолата. Целта е проста, но вълнуваща - бързо докоснете и угасете светлините, за да спечелите точки. Играчът, който успешно улови повече светлини от своя опонент в рамките на определен период от време, става победител в играта. Подходяща както за деца, така и за възрастни, тази вълнуваща игра гарантира оспорвано и приятно състезание за всички участници.`,
  },
  {
    image: '/ship.jpg',
    title: 'Кораба лабиринт',
    description: `Големият син кораб лабиринт е цветна и завладяваща атракция, която предизвиква участниците да навигират през сложна мрежа от коридори, използвайки остроумие и стратегическо мислене. Лабиринтът е боядисан в ярко синьо, създавайки жизнена и приветлива атмосфера. Състоящ се от множество пътеки с минимален брой изходи, той добавя напрежение и вълнение към играта, като същевременно насърчава критичното мислене, решаването на проблеми и търпението сред участниците. Идеален за семейства и групи приятели, търсещи забавен начин да прекарат качествено време заедно или да се състезават в приятелско съревнование, големият син кораб лабиринт предлага забавно и образователно изживяване за всички.`,
  },
];

const NeverlandPage: React.FC = () => {
  return (
    <PageWrapper page={'page'} header={'header'} footer={'footer'}>
      <section className="pt-[108px] pb-10 overflow-hidden md:pb-20 lg:pt-[218px] lg:pb-[120px] min-h-[130vh]">
        <div className="container max-w-[1198px] ">
          <ArchWithStar />
          <div className="relative px-4 max-w-[400px] mx-auto mb-10 lg:max-w-[745px] lg:mb-20 xl:px-0">
            <Image
              src={'/Neverland__11zon.png'}
              alt="neverland"
              width={1078}
              height={678}
              className="w-full h-auto cover rounded-[10px] overflow-hidden pointer-events-auto"
            />
          </div>
        </div>
        <div className="container">
          {
            <div className="grid grid-cols-1 gap-6 lg:grid-cols-2 lg:gap-8">
              {games.map((item, index) => (
                <EventsPageEventCard key={index} card={item} />
              ))}
            </div>
          }
        </div>
      </section>
    </PageWrapper>
  );
};

export default NeverlandPage;
